* Ссылки [[~/org/sbcl/sbcl-referencies.org][Ссылки]]
* Генерирование документации
#+name: graphs
#+BEGIN_SRC lisp
  (defun make-document ()
        (loop
          :for i :in
          '((:areas      :areas)
            )
          :do (apply #'mnas-package:document i)))

  (defun make-graphs ()
        (loop
          :for i :in
          '(:areas
            )
          :do (mnas-package:make-codex-graphs i i)))

  (defun make-all ()
    (make-document)
    (make-graphs)
    (codex:document :areas)
    (make-graphs))

  (make-all)
#+END_SRC

#+RESULTS: graphs
: NIL

* Публикация
#+name: publish
#+BEGIN_SRC shell :var graphs=graphs
    mkdir -p "$HOME/public_html/Common-Lisp-Programs/"
    CDIR=`dirname $PWD | xargs basename`
    rsync -Pazh --delete ../docs/build/$CDIR/html/ $HOME/public_html/Common-Lisp-Programs/$CDIR 
    if [[ `hostname` == "mnasoft-00" ]]
    then
	echo "mnasoft-00"
  #     sh ~/bin/pi-html
    fi
    if [[ `hostname` == "N118383" ]]
    then
	echo "N118383"
        CPL="//n133619/home/_namatv/public_html/Site/Development/Common-Lisp-Programs"
	mkdir -p $CPL/$CDIR
	rsync -Pazh --delete ../docs/build/$CDIR/html/ $CPL/$CDIR
     fi
#+END_SRC

#+RESULTS: publish
| sending                   | incremental | file | list       |         |   |         |      |            |         |          |               |
| ./                        |             |      |            |         |   |         |      |            |         |          |               |
| areas.html                |             |      |            |         |   |         |      |            |         |          |               |
|                           | 11.12K      | 100% | 0.00kB/s   | 0:00:00 |   | 11.12K  | 100% | 0.00kB/s   | 0:00:00 | (xfr#1,  | to-chk=14/16) |
| call-graph-areas.gv       |             |      |            |         |   |         |      |            |         |          |               |
|                           | 747         | 100% | 729.49kB/s | 0:00:00 |   | 747     | 100% | 729.49kB/s | 0:00:00 | (xfr#2,  | to-chk=13/16) |
| call-graph-areas.gv.png   |             |      |            |         |   |         |      |            |         |          |               |
|                           | 32.77K      |  30% | 31.25MB/s  | 0:00:00 |   | 105.78K | 100% | 100.88MB/s | 0:00:00 | (xfr#3,  | to-chk=12/16) |
| class-graph-areas.gv      |             |      |            |         |   |         |      |            |         |          |               |
|                           | 631         | 100% | 616.21kB/s | 0:00:00 |   | 631     | 100% | 616.21kB/s | 0:00:00 | (xfr#4,  | to-chk=11/16) |
| class-graph-areas.gv.png  |             |      |            |         |   |         |      |            |         |          |               |
|                           | 32.77K      |  47% | 31.25MB/s  | 0:00:00 |   | 68.98K  | 100% | 4.39MB/s   | 0:00:00 | (xfr#5,  | to-chk=10/16) |
| symbol-graph-areas.gv     |             |      |            |         |   |         |      |            |         |          |               |
|                           | 44          | 100% | 2.86kB/s   | 0:00:00 |   | 44      | 100% | 2.86kB/s   | 0:00:00 | (xfr#6,  | to-chk=9/16)  |
| symbol-graph-areas.gv.png |             |      |            |         |   |         |      |            |         |          |               |
|                           | 116         | 100% | 7.55kB/s   | 0:00:00 |   | 116     | 100% | 7.55kB/s   | 0:00:00 | (xfr#7,  | to-chk=8/16)  |
| system-graph-areas.gv     |             |      |            |         |   |         |      |            |         |          |               |
|                           | 120         | 100% | 7.81kB/s   | 0:00:00 |   | 120     | 100% | 7.81kB/s   | 0:00:00 | (xfr#8,  | to-chk=7/16)  |
| system-graph-areas.gv.png |             |      |            |         |   |         |      |            |         |          |               |
|                           | 17.96K      | 100% | 1.14MB/s   | 0:00:00 |   | 17.96K  | 100% | 1.14MB/s   | 0:00:00 | (xfr#9,  | to-chk=6/16)  |
| графы-areas.html          |             |      |            |         |   |         |      |            |         |          |               |
|                           | 2.00K       | 100% | 130.08kB/s | 0:00:00 |   | 2.00K   | 100% | 130.08kB/s | 0:00:00 | (xfr#10, | to-chk=5/16)  |
| обзор.html                |             |      |            |         |   |         |      |            |         |          |               |
|                           | 1.78K       | 100% | 115.82kB/s | 0:00:00 |   | 1.78K   | 100% | 115.82kB/s | 0:00:00 | (xfr#11, | to-chk=4/16)  |
| static/                   |             |      |            |         |   |         |      |            |         |          |               |
| static/highlight.css      |             |      |            |         |   |         |      |            |         |          |               |
|                           | 1.57K       | 100% | 49.49kB/s  | 0:00:00 |   | 1.57K   | 100% | 49.49kB/s  | 0:00:00 | (xfr#12, | to-chk=2/16)  |
| static/highlight.js       |             |      |            |         |   |         |      |            |         |          |               |
|                           | 22.99K      | 100% | 724.20kB/s | 0:00:00 |   | 22.99K  | 100% | 724.20kB/s | 0:00:00 | (xfr#13, | to-chk=1/16)  |
| static/style.css          |             |      |            |         |   |         |      |            |         |          |               |
|                           | 4.32K       | 100% | 136.15kB/s | 0:00:00 |   | 4.32K   | 100% | 136.15kB/s | 0:00:00 | (xfr#14, | to-chk=0/16)  |
| N118383                   |             |      |            |         |   |         |      |            |         |          |               |
| sending                   | incremental | file | list       |         |   |         |      |            |         |          |               |
| ./                        |             |      |            |         |   |         |      |            |         |          |               |
| areas.html                |             |      |            |         |   |         |      |            |         |          |               |
|                           | 11.12K      | 100% | 0.00kB/s   | 0:00:00 |   | 11.12K  | 100% | 0.00kB/s   | 0:00:00 | (xfr#1,  | to-chk=14/16) |
| call-graph-areas.gv       |             |      |            |         |   |         |      |            |         |          |               |
|                           | 747         | 100% | 729.49kB/s | 0:00:00 |   | 747     | 100% | 729.49kB/s | 0:00:00 | (xfr#2,  | to-chk=13/16) |
| call-graph-areas.gv.png   |             |      |            |         |   |         |      |            |         |          |               |
|                           | 32.77K      |  30% | 31.25MB/s  | 0:00:00 |   | 105.78K | 100% | 100.88MB/s | 0:00:00 | (xfr#3,  | to-chk=12/16) |
| class-graph-areas.gv      |             |      |            |         |   |         |      |            |         |          |               |
|                           | 631         | 100% | 41.08kB/s  | 0:00:00 |   | 631     | 100% | 41.08kB/s  | 0:00:00 | (xfr#4,  | to-chk=11/16) |
| class-graph-areas.gv.png  |             |      |            |         |   |         |      |            |         |          |               |
|                           | 32.77K      |  47% | 2.08MB/s   | 0:00:00 |   | 68.98K  | 100% | 4.39MB/s   | 0:00:00 | (xfr#5,  | to-chk=10/16) |
| symbol-graph-areas.gv     |             |      |            |         |   |         |      |            |         |          |               |
|                           | 44          | 100% | 2.86kB/s   | 0:00:00 |   | 44      | 100% | 2.86kB/s   | 0:00:00 | (xfr#6,  | to-chk=9/16)  |
| symbol-graph-areas.gv.png |             |      |            |         |   |         |      |            |         |          |               |
|                           | 116         | 100% | 7.55kB/s   | 0:00:00 |   | 116     | 100% | 7.55kB/s   | 0:00:00 | (xfr#7,  | to-chk=8/16)  |
| system-graph-areas.gv     |             |      |            |         |   |         |      |            |         |          |               |
|                           | 120         | 100% | 7.81kB/s   | 0:00:00 |   | 120     | 100% | 7.81kB/s   | 0:00:00 | (xfr#8,  | to-chk=7/16)  |
| system-graph-areas.gv.png |             |      |            |         |   |         |      |            |         |          |               |
|                           | 17.96K      | 100% | 1.14MB/s   | 0:00:00 |   | 17.96K  | 100% | 1.14MB/s   | 0:00:00 | (xfr#9,  | to-chk=6/16)  |
| графы-areas.html          |             |      |            |         |   |         |      |            |         |          |               |
|                           | 2.00K       | 100% | 130.08kB/s | 0:00:00 |   | 2.00K   | 100% | 130.08kB/s | 0:00:00 | (xfr#10, | to-chk=5/16)  |
| обзор.html                |             |      |            |         |   |         |      |            |         |          |               |
|                           | 1.78K       | 100% | 115.82kB/s | 0:00:00 |   | 1.78K   | 100% | 115.82kB/s | 0:00:00 | (xfr#11, | to-chk=4/16)  |
| static/                   |             |      |            |         |   |         |      |            |         |          |               |
| static/highlight.css      |             |      |            |         |   |         |      |            |         |          |               |
|                           | 1.57K       | 100% | 14.08kB/s  | 0:00:00 |   | 1.57K   | 100% | 14.08kB/s  | 0:00:00 | (xfr#12, | to-chk=2/16)  |
| static/highlight.js       |             |      |            |         |   |         |      |            |         |          |               |
|                           | 22.99K      | 100% | 181.05kB/s | 0:00:00 |   | 22.99K  | 100% | 181.05kB/s | 0:00:00 | (xfr#13, | to-chk=1/16)  |
| static/style.css          |             |      |            |         |   |         |      |            |         |          |               |
|                           | 4.32K       | 100% | 34.04kB/s  | 0:00:00 |   | 4.32K   | 100% | 34.04kB/s  | 0:00:00 | (xfr#14, | to-chk=0/16)  |


